import React from 'react';
import "./style.css"
import CommonPage from "../CommonPage";

import { Accordion, AccordionItem, AccordionButton, AccordionPanel, Box, AccordionIcon } from "@chakra-ui/react";
const LibararyAccodring = () => {
    return (
        <>
            <div>

                <Accordion defaultIndex={[0]} m={"auto"} width="80%">
                    <AccordionItem>
                        <h2>
                            <AccordionButton>
                                <Box as="span" flex='1' textAlign='right'>
                                    ماهي الوثائق العامة المطلوبة للالتحاق ببرامج البكالوريوس؟
                                </Box>
                                <AccordionIcon />
                            </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign='right'>
                            كشف علامات شهادة الثانوية العامة أو ما يعادلها مصدقة من وزارة التربية والتعليم أو صورة مصدقة عنها.
                            شهادة كفاءة اللغة الإنجليزية بمعدل 500 في TOFEL ITP أو 5 في IELTS على الأقل (يستثنى من ذلك البرامج التي تدرس باللغة العربية)
                            صورة عن جواز السفر.
                            3 صور شخصية.
                            صورة عن بطاقة الهوية.
                        </AccordionPanel>
                    </AccordionItem>

                    <AccordionItem>
                        <h2>
                            <AccordionButton>
                                <Box as="span" flex='1' textAlign='right'>
                                    ماهي الوثائق العامة المطلوبة للالتحاق في برامج الدراسات العليا؟
                                </Box>
                                <AccordionIcon />
                            </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign='right'>
                            شهادة البكالوريوس أو ما يعادلها من جامعة معتمدة لدى وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات.
                            معادلة شهادة البكالوريوس من وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات إذا كانت الشهادة صادرة من خارج الدولة.
                            شهادة كفاءة اللغة الإنجليزية (TOFEL أو IELTS)، (حسب التخصص المطلوب).
                            كشف العلامات الأصلي، وإذا كان من خارج الدولة يجب تصديقه حسب الأصول.
                            صورة عن جواز السفر
                            صورة عن بطاقة الهوية الإماراتية
                            صورتان شخصيتان
                        </AccordionPanel>
                    </AccordionItem>

                    <AccordionItem>
                        <h2>
                            <AccordionButton>
                                <Box as="span" flex='1' textAlign='right'>
                                    ماهي الوثائق العامة المطلوبة للالتحاق في برامج الدراسات العليا؟
                                </Box>
                                <AccordionIcon />
                            </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign='right'>
                            شهادة البكالوريوس أو ما يعادلها من جامعة معتمدة لدى وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات.
                            معادلة شهادة البكالوريوس من وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات إذا كانت الشهادة صادرة من خارج الدولة.
                            شهادة كفاءة اللغة الإنجليزية (TOFEL أو IELTS)، (حسب التخصص المطلوب).
                            كشف العلامات الأصلي، وإذا كان من خارج الدولة يجب تصديقه حسب الأصول.
                            صورة عن جواز السفر
                            صورة عن بطاقة الهوية الإماراتية
                            صورتان شخصيتان
                        </AccordionPanel>
                    </AccordionItem>

                    <AccordionItem>
                        <h2>
                            <AccordionButton>
                                <Box as="span" flex='1' textAlign='right'>
                                    ماهي الوثائق العامة المطلوبة للالتحاق في برامج الدراسات العليا؟
                                </Box>
                                <AccordionIcon />
                            </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign='right'>
                            شهادة البكالوريوس أو ما يعادلها من جامعة معتمدة لدى وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات.
                            معادلة شهادة البكالوريوس من وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات إذا كانت الشهادة صادرة من خارج الدولة.
                            شهادة كفاءة اللغة الإنجليزية (TOFEL أو IELTS)، (حسب التخصص المطلوب).
                            كشف العلامات الأصلي، وإذا كان من خارج الدولة يجب تصديقه حسب الأصول.
                            صورة عن جواز السفر
                            صورة عن بطاقة الهوية الإماراتية
                            صورتان شخصيتان
                        </AccordionPanel>
                    </AccordionItem>

                    <AccordionItem>
                        <h2>
                            <AccordionButton>
                                <Box as="span" flex='1' textAlign='right'>
                                    ماهي الوثائق العامة المطلوبة للالتحاق في برامج الدراسات العليا؟
                                </Box>
                                <AccordionIcon />
                            </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign='right'>
                            شهادة البكالوريوس أو ما يعادلها من جامعة معتمدة لدى وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات.
                            معادلة شهادة البكالوريوس من وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات إذا كانت الشهادة صادرة من خارج الدولة.
                            شهادة كفاءة اللغة الإنجليزية (TOFEL أو IELTS)، (حسب التخصص المطلوب).
                            كشف العلامات الأصلي، وإذا كان من خارج الدولة يجب تصديقه حسب الأصول.
                            صورة عن جواز السفر
                            صورة عن بطاقة الهوية الإماراتية
                            صورتان شخصيتان
                        </AccordionPanel>
                    </AccordionItem>

                    <AccordionItem>
                        <h2>
                            <AccordionButton>
                                <Box as="span" flex='1' textAlign='right'>
                                    ماهي الوثائق العامة المطلوبة للالتحاق في برامج الدراسات العليا؟
                                </Box>
                                <AccordionIcon />
                            </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign='right'>
                            شهادة البكالوريوس أو ما يعادلها من جامعة معتمدة لدى وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات.
                            معادلة شهادة البكالوريوس من وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات إذا كانت الشهادة صادرة من خارج الدولة.
                            شهادة كفاءة اللغة الإنجليزية (TOFEL أو IELTS)، (حسب التخصص المطلوب).
                            كشف العلامات الأصلي، وإذا كان من خارج الدولة يجب تصديقه حسب الأصول.
                            صورة عن جواز السفر
                            صورة عن بطاقة الهوية الإماراتية
                            صورتان شخصيتان
                        </AccordionPanel>
                    </AccordionItem>

                    <AccordionItem>
                        <h2>
                            <AccordionButton>
                                <Box as="span" flex='1' textAlign='right'>
                                    ماهي الوثائق العامة المطلوبة للالتحاق في برامج الدراسات العليا؟
                                </Box>
                                <AccordionIcon />
                            </AccordionButton>
                        </h2>
                        <AccordionPanel pb={4} textAlign='right'>
                            شهادة البكالوريوس أو ما يعادلها من جامعة معتمدة لدى وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات.
                            معادلة شهادة البكالوريوس من وزارة التربية والتعليم –شؤون التعليم العالي في دولة الإمارات إذا كانت الشهادة صادرة من خارج الدولة.
                            شهادة كفاءة اللغة الإنجليزية (TOFEL أو IELTS)، (حسب التخصص المطلوب).
                            كشف العلامات الأصلي، وإذا كان من خارج الدولة يجب تصديقه حسب الأصول.
                            صورة عن جواز السفر
                            صورة عن بطاقة الهوية الإماراتية
                            صورتان شخصيتان
                        </AccordionPanel>
                    </AccordionItem>
                </Accordion>
            </div>
        </>
    );
}

export default LibararyAccodring;
